/*
1. Timus 1162 Белман
2. Timus 1272 Краскал или Прим     +
3. Задача                          +
Дано:
Фамилия, номер вклада и сумма вклада
есть несколько таких строчек в файле
В другой файл нужно записать спсиок вкладчиков чей номер начинатся на заданную цирфу отсоритровнный по убыванию сумм вклада

Если таких нет то сообщить об этом
Для решения написать класс и методы

--------------------
Для желающих
создать структура папок с использованием map
-------------------

Транспартровка кружек Готова  урааа +

Задача СМС с тимуса Тимус 1427 +

*/