// Дз
// 1. Тимус 1080 
// Граф оренитрованный йоу
//
// проерка на двудольность (BFS) хихихи
//
// 2. Тимус 1837  BFS
// 
// В каждой команде 3 человека
// У Isenbaev номер 0
// 100 команд значит людей 300
// тогда матрица смежности 301 на 301
// каждая вершина это номер человека
// Исенбаев сам с собой ноль
// Найти растояние от Исенбаева
// 
// В конце если used[i] = нулю то выводим undefined
// 
// как составить граф?
// 
// сортровать именна срау и ьанарный поиск
// 
// или массив стрнгов 3 на 7
// заполняем потом их закидываем в set 
// 
// самое сложное создать граф
//
// 3. Тимус 1982 
// DSU  план электрофикации
// 
// Сначала все станции в одной компонннте в одном множестве
// А города в разных
// 
// Можно создать срукутру ребер и сортровать их в порядка возрастания а потом объеденять множества 
//


