// Тимус 1260 Фотограф зануда         +
// Тимус 2018 Дебютный альбом         +
// Тимус 1210 Добрые духи
// 
// Тимус 1562 Ананас                  +
// 
// Кометарии к Ананансу
// Известно что его пореали наn частей
// Изветсна формула  x^2/a^2 + y^2/b^2 = 1   y^2 = (1 - (x^2 / a^2)) * b^2 => y^2 = b^2 - (x*b/a)^2 
// Выразить y и подставить  в интегралл для кждой точки
// 
// V = интеграл от a до b y^2 dx  = b^2*x - (x^3 * b^2 / 3*a^2)
// 
// Считаем точки и подставляем в формулу
// 
// Вывод до 6 знаков после запятой 
// 
// 
// 
// Задача 
// Есть файл со словами англ
// А также есть второй файл с текстом (нормальным)
// Нужно определить есть ли слово в тексте 
// Если оно есть опсчитать сокльок раз втсретилоссь
// Потом написать остортированный по убыванию втсречаемости слов в тексте, если нету таких то не печатать
// 
// 
// 
// Задача (легко) --
// В файле есть матрица инцидентности
// Нужно получить матрицу смежности
// 


// window.h

// книжка 
// API автор Щупак 
// Питер ком 

