//
// 1. Timus 1033
// Снова лабиринт, есть лабиринт
// граф bfs 
// 
// 2. Тимус 1008 
// Есть картинка в на X Y
// Кодируется либо координатами либо какойто странной штукой
// нужно перевести из одного в другое
// 
// выделяем нужную память 
// вели вершины и задали граф в виде матрици смежности
// проходим по графу, находим левую нижнюю точку и используем bfs
// 
// Можно DSU создать из маиисва списков
// где санчла спикое указывает на себя
// В листе хранится указетль на ноль и на себя и размер множества, имя множества
// 
// 
// 
// 
